# Занятия по информатике в 8мл классе ЮМШ. 2022-2023

Преподаватель: Борис Юрьевич Пичугин

---

- [Позиционная система счисления](#позиционная-система-счисления)
  - [2022.09.10 Позиционная система счисления](#20220910-позиционная-система-счисления)
  - [2022.09.17 Позиционная система счисления](#20220917-позиционная-система-счисления)
  - [2022.09.24 Позиционная система счисления](#20220924-позиционная-система-счисления)
  - [2022.10.01 Позиционная система счисления](#20221001-позиционная-система-счисления)
  
---

## Позиционная система счисления

### 2022.09.10 Позиционная система счисления

**Определениею.** Пусть $q\in\mathbb{N}$, $a\in\mathbb{R}$. Представление

$$a=\pm(d_n q^n+\dots+d_0 q^0+d_{-1} q^{-1}+d_{-2} q^{-2}+\dots+d_{-k} q^{-k}+\dots),$$

где $d_i\in\{0,1,\dots,q-1\}$, называется **записью числа $a$ в позиционной системе счисления с основанием $q$**.

Числа $d_i$ называются **цифрами** числа $a$. Для записи цифр используют символы из последовательности: $\text{0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F}, \dots$.

Коротко записывают так:

$$a=\pm\overline{d_n\dots{}d_0{,}d_{-1}d_{-2}\dots d_{-k}\dots}_q$$

Примеры записи:

$$123{,}345_7=1\cdot7^2+2\cdot7^1+3\cdot7^0+3\cdot7^{-1}+4\cdot7^{-2}+5\cdot7^{-3},$$

$$\text{AB2}{,}\text{FE}_{16}=10\cdot16^2+11\cdot16^1+2\cdot16^0+15\cdot16^{-1}+14\cdot16^{-2}.$$

Свойства чисел такие как делимость, сравнимость, рациональность, иррациональность, больше, меньше, равенство, и т.п. никак не зависят от способа записи числа.

#### Задачи

1. Переведите число $123_{10}$ в пятиричную систему счисления.

2. Переведите число $123{,}45_{10}$ в пятиричную систему счисления.

3. Сформулируйте признак делимости на $q^n$ в системе счисления с основанием $q$.

4. Пусть $q\equiv_m 1$. Сформулируйте признак делимости на $m$ в системе счисления с основанием $q$.

5. Пусть $q\equiv_m -1$. Сформулируйте признак делимости на $m$ в системе счисления с основанием $q$.

#### Домашнее задание

Срок сдачи: 2022.09.17 11:45.

1. Переведите число $557{,}12_{10}$ в двоичную, троичную, шестиричную и шестнадцатиричную системы счисления. Обратите внимание, что во всех четырёх системах счисления вы получите периодическую дробь. Ваша задача найти этот период.

### 2022.09.17 Позиционная система счисления

#### Задачи

1. Переведите число $274_{10}$ в семиричную систему счисления.

2. Переведите число $-274{,}45_{10}$ в семиричную систему счисления.

3. Докажите, что конечная десятичная дробь всегда будет периодической в системе счисления $q$, если $q$ взаимно просто с $10$.

4. Вычислите $254_{7} + 6654_{7}$, $204_{5} \cdot 441_{5}$, $345_{6} / 10_{6}$, $345_{6} / 15_{6}$.

5. Вычислите $204_{5} + 333_{10}$.

6. Напишите программу перевода данного целого числа из десятичной системы счисления в систему счисления с данным основанием $q$.

7. Напишите программу, которая последовательно печатает на экране первых $100$ натуральных чисел в системе счисления с данным основанием $q$.

#### Домашнее задание

Для успешной сдачи этого домашнего задания нужно решить не менее одной задачи из списка.

Срок сдачи: 2022.10.01 11:45.

1. Напишите программу, которая печатает 100 цифр после запятой данного числа $a\in[0;1)$ в системе счисления с данным основанием. Дробные числа в памяти компьютера записываются в двоичной системе счисления с фиксированным числом знаков после запятой. Поэтому все дробные числа, двоичная запись которых является бесконечной дробью, хранятся в памяти не точно (и, к сожалению, не только они). Например, число $0{,}3$ в двоичной системе является периодической дробью, и, значит, не может быть записано в память точно. Так вот. Чтобы точно выписать все цифры данного числа $a$ в нужной системе счисления у пользователя надо спросить два целых числа $b$ и $p$ и считать, что $a = \frac{b}{10^p}$, а все вычисления проводить только в целых числах. Например, для перевода числа $0{,}0015$ пользователь должен будет ввести $b = 15$ и $p=4$.

2. (*) Модифицировать программу 1 так, чтобы программа находила период дроби, если он есть. Например, число $0{,}25$ в двоичной системе счисления является конечной дробью $0{,}01_2$, а в троичной системе счисления периодической $0{,}(02)_3$. Поэтому в первом случае программа должна напечатать `0.01_2`, а во втором - `0.(02)_3`.

### 2022.09.24 Позиционная система счисления

#### Задачи

1. Напишите функцию преобразования строки в целое число. Данная строка представляет собой последовательность цифр целого числа, записанного в позиционной системе счисления с данным основанием $q$. Для получения значения цифры из её символа можно воспользоваться функцией `char_to_digit`.

```Python
def str_to_int(a: str, q: int) -> int:
    # Ваш код тут

def char_to_digit(ch: str) -> int:
    if '0' <= ch <= '9':
        return ord(ch) - ord('0')
    if 'A' <= ch <= 'Z':
        return ord(ch) - ord('A') + 10
    if 'a' <= ch <= 'z':
        return ord(ch) - ord('a') + 10
    raise Exception(f"Символ {ch} не является цифрой.")
```

2. Напишите функцию преобразования строки в действительное число. Данная строка представляет собой последовательность цифр действительного числа, записанного в позиционной системе счисления с данным основанием $q$.

```Python
def str_to_float(a: str, q:int) -> float:
    # Ваш код тут

def char_to_digit(ch:str) -> int:
    if '0' <= ch <= '9':
        return ord(ch) - ord('0')
    if 'A' <= ch <= 'Z':
        return ord(ch) - ord('A') + 10
    if 'a' <= ch <= 'z':
        return ord(ch) - ord('a') + 10
    raise Exception(f"Символ {ch} не является цифрой.")
```

### 2022.10.01 Позиционная система счисления

#### Задачи

1. Напишите функцию сложения двух целых чисел в позиционной системе счисления с данным основанием. В функцию каждое слагаемое передаётся в виде строки, состоящей из цифр числа. Результат также следует представить в виде строки, состоящей из цифр числа.

```Python
def add(a: str, b:str, q:int) -> str:
    # Ваш код тут
```

2. (*) Напишите функцию умножения двух целых чисел в позиционной системе счисления с данным основанием. В функцию каждое слагаемое передаётся в виде строки, состоящей из цифр числа. Результат также следует представить в виде строки, состоящей из цифр числа.

```Python
def multiply(a: str, b:str, q:int) -> str:
    # Ваш код тут
```

#### Домашнее задание

Срок сдачи: 2022.10.08 11:45.

**Замечание.** Если вы уже сдали эту задачу в классе, то всё равно пришлите мне письмо с правильным заголовком, в котором укажите, что сдали сложение столбиком в классе.

1. Напишите функцию сложения двух целых чисел в позиционной системе счисления с данным основанием, **используя алгоритм сложения чисел в столбик**. В функцию каждое слагаемое передаётся в виде строки, состоящей из цифр числа. Результат также следует представить в виде строки, состоящей из цифр числа.

```Python
def add(a: str, b:str, q:int) -> str:
    # Ваш код тут

def char_to_digit(ch:str) -> int:
    if '0' <= ch <= '9':
        return ord(ch) - ord('0')
    if 'A' <= ch <= 'Z':
        return ord(ch) - ord('A') + 10
    if 'a' <= ch <= 'z':
        return ord(ch) - ord('a') + 10

print(add("101", "11", 2))
print(add("12376", "1177", 8))
print(add("FFFF", "123456789", 8))
```

Программа должна вывести на экран:

```Text
111
13575
123466788
```
